import AskAnswer from '../components/AskAnswer'

export default function FAQ() {

     const arrayOfFaq = [
          {
               ask: "چطور درسی رو به برنامم اضافه کنم؟",
               answer: "کافیه از منوی کناری گزینه درس جدید رو انتخاب کنید و نام درس ، توضیحات ، روز هفته و ساعت شروع و پایان کلاس رو انتخاب کرده و تایید کنید.توجه داشته باشید که اگر تایمی رو ثبت کنید که با تایم قبلی تون تداخل داشته باشه درس جدید حذف میشه و اطلاعاتش در دسترس نیست"
          },
          {
               ask: "میتونم لیست تمام درس هارو در قالب PDF داشته باشم؟",
               answer: "این آپشن در ورژن جدید فعال شده و کافیه به صفحه تنظیمات رفته و روی دریافت فایل پی دی اف کلیک کنید"
          },
          {
               ask: "به یک باگ/اروری خوردم. چطور به ادمین خبر بدم؟",
               answer: "میتونید به آیدی @mbhdev در تلگرام پیام بدید "
          },
          {
               ask: "چرا زمانی که میخوام تایم انتخاب کنم صفحه اسکرول میشه؟",
               answer: "این مشکل به این دلیل پیش میاد که مرورگر متوجه نمیشه که اسکرول شما روی باکس انتخاب هست ، برای رفع این مشکل کافیه یکبار روی اعداد کلیک کنید تا مرورگر روی باکس فوکوس کنه."
          },
          {
               ask: "چطور میتونم تمام درس هایی که به برنامم اضافه شده رو ببینم؟",
               answer: "از طریق منوی کنار صفحه و گزینه نمایش تمام درس ها ، تمام درس هایی که به برنامه خودتون اضافه کردید رو میتونید ببینید"
          },
          {
               ask: "تایم مدرسه / دانشگاه من از 8 الی 17 بیشتره/ کمتره. چطور میتونم تنظیممش کنم؟",
               answer: "از بخش تنظیم تایم روز در منوی کناری میتونید تایم روز هایی که در دانشگاه / مدرسه هستید رو تنظیم کنید. "
          },
          {
               ask: "آیا درس چین نسخه دسکتاپ نداره ؟",
               answer: "با تحقیقاتی که روی کاربران احتمالی سایت انجام شد ، متوجه شدیم که 85 تا 95 درصد کاربران درس چین از موبایل استفاده میکنند. بر این شد که تصمیم گرفتیم فاز اول و آزمایشی درس چین رو موبایل فرست ران کنیم. درصورت حمایت شما نسخه های بعدی بصورت کاملا ریسپانسیو خواهد بود"
          },
          {
               ask: "چطور میتونم حمایت کنم؟",
               answer: "کافیه به ریپو این پروژه در گیتهاب (لینک در پایان صفحه)استار بدید."
          }
     ]

     return (
          <>
               <section className='w-full px-4 '>
                    <div className='absolute top-10 left-0 w-full' dir='rtl'>
                         <div className='w-full flex justify-center scale-y-200 scale-x-120 rotate-y-180'>
                              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
                                   <path className='fill-indigo-300' fillOpacity="1" d="M0,128L48,160C96,192,192,256,288,277.3C384,299,480,277,576,245.3C672,213,768,171,864,165.3C960,160,1056,192,1152,176C1248,160,1344,96,1392,64L1440,32L1440,0L1392,0C1344,0,1248,0,1152,0C1056,0,960,0,864,0C768,0,672,0,576,0C480,0,384,0,288,0C192,0,96,0,48,0L0,0Z"></path>
                              </svg>
                         </div>
                         <h1 className='absolute top-8 right-0 mr-4 text-2xl xsl:text-3xl font-morabba-bold'>سوالات متداول</h1>
                    </div>
                    <div className='mt-36 mb-16'>

                         {
                              arrayOfFaq.map(item => (
                                   <AskAnswer
                                        key={Math.random() * 1000}
                                        ask={item.ask}
                                        answer={item.answer}
                                   />
                              ))
                         }

                    </div>
               </section>
               <div className="absolute -bottom-0 w-full px-4" dir='rtl'>
                    <p className='text-sm font-morabba text-left dark:text-white' >
                         ساخته شده با💛 توسط <a target={'_blank'} href='http://mbahri.ir' className='font-gothic-bold underline'>MBahri.ir</a>
                         <a href="https://github.com/mortezabhri/darschin-react" className='text-black dark:text-white underline inline-block mx-2'>(لینک گیتهاب پروژه)</a>
                    </p>
               </div>
          </>
     )
}
